#include<stdio.h> // 数据类型的极限值
#include<limits.h> // int的极限
#include<float.h> // float的极限

void main(){
    //   十进制小数形式
//    printf("%f      ",100.1);   //
//    printf("%f      ",.1);   //
//    printf("%f      ",0.0);   //  默认小数点后会有六位
//    // 指数
//    printf("%f      ",10e4);   //
//    printf("%f      ",10e-4);   //  e可大小写
    printf("%f     %.10f",FLT_MAX,FLT_MIN);   //  e可大小写
//    340282346638528860000000000000000000000.000000     0.0000000000
    // double       8字节       阶码11位    指数-1023  +1023




    // float        4 字节
    // 在内存中以e存储
    //  0000 0000 0000 0000 0000 0000 0000 0000 0000
    // 第31 位，表示正负
    // 第30 - 23 位，8个，表示阶码（2的多少次方 和127 的和）
    // 第22 - 0 位 ， 23个表示小数
    // 权重依次为 2的-n次方
    // 0.5      0.25     0.125
//    sizeof(1.0)      8
//    sizeof(1.0f)      4
//例子
/*  float
12.5 = 1100.1 = 1.1001 * 2^3
---->
0 10000010  1001000000000000000000000000
    3+127
---->


*/
}