"""
    就是始终在剩余的里面寻找最小或最大的元素.


    选择排序是一种不稳定的排序方法,最好\最坏\平均  情况下的时间复杂度都为O(n*n),空间复杂度为O(1)
"""


def select_sort(lists):
    count = len(lists)
    for i in range(0, count):

        min_ = i
        for j in range(i + 1, count):
            if lists[j] < lists[min_]:
                min_ = j
        lists[min_], lists[i] = lists[i], lists[min_]
        print('第%s次排序结果' % i, lists)


if __name__ == '__main__':
    select_sort([38, 65, 97, 76, 13, 27, 49])
    """
第0次排序结果 [13, 65, 97, 76, 38, 27, 49]
第1次排序结果 [13, 27, 97, 76, 38, 65, 49]
第2次排序结果 [13, 27, 38, 76, 97, 65, 49]
第3次排序结果 [13, 27, 38, 49, 97, 65, 76]
第4次排序结果 [13, 27, 38, 49, 65, 97, 76]
第5次排序结果 [13, 27, 38, 49, 65, 76, 97]
第6次排序结果 [13, 27, 38, 49, 65, 76, 97]
    """
