"""
冒泡排序是一种稳定的排序方法,
    最好情况下的时间复杂度为O(n)
    最坏情况下的时间复杂度为O(n*n)
    平均情况下的时间复杂度为O(n*n)


"""


def bubble_sort(lists):
    print('排序前:', lists)
    n = len(lists)
    for i in range(n):
        for j in range(i + 1, n):
            if lists[i] > lists[j]:  # 保证每次循环中,都可以使最小数跑到首位
                lists[i], lists[j] = lists[j], lists[i]
                print('排序中:', lists)  #
    print('排序后:', lists)


if __name__ == '__main__':
    bubble_sort([3, 4, 2, 8, 9, 5, 1])
"""
排序前: [3, 4, 2, 8, 9, 5, 1]
排序中: [2, 4, 3, 8, 9, 5, 1]
排序中: [1, 4, 3, 8, 9, 5, 2]
排序中: [1, 3, 4, 8, 9, 5, 2]
排序中: [1, 2, 4, 8, 9, 5, 3]
排序中: [1, 2, 3, 8, 9, 5, 4]
排序中: [1, 2, 3, 5, 9, 8, 4]
排序中: [1, 2, 3, 4, 9, 8, 5]
排序中: [1, 2, 3, 4, 8, 9, 5]
排序中: [1, 2, 3, 4, 5, 9, 8]
排序中: [1, 2, 3, 4, 5, 8, 9]
排序后: [1, 2, 3, 4, 5, 8, 9]
"""
